{"﻿{\"intents\": [\n    {\"tag\": \"greeting\",\n     \"patterns\": [\"Hi there\", \"How are you\", \"Is anyone there?\", \"Hey\", \"Hola\", \"Hello\", \"Good day\"],\n     \"responses\": [\"Hello\", \"Good to see you again\", \"Hi there, how can I help?\"],\n     \"context\": [\"\"]\n    },\n    {\"tag\": \"goodbye\",\n     \"patterns\": [\"Bye\", \"See you later\", \"Goodbye\", \"Nice chatting to you, bye\", \"Till next time\"],\n     \"responses\": [\"See you!\", \"Have a nice day\", \"Bye! Come back again soon.\"],\n     \"context\": [\"\"]\n    },\n    {\"tag\": \"thanks\",\n     \"patterns\": [\"Thanks\", \"Thank you\", \"That's helpful\", \"Awesome, thanks\", \"Thanks for helping me\"],\n     \"responses\": [\"My pleasure\", \"You're Welcome\"],\n     \"context\": [\"\"]\n    },\n    {\"tag\": \"introduction\",\n     \"patterns\": [\"Introduce yourself\", \"Tell me a bit about yourself.\", \"What's your story?\", \"What would you like me to know about you?\"],\n     \"responses\": [\"I recently graduated with a degree in Software Engineering and am eager to kickstart my career in developing innovative software solutions. I have a strong foundation in programming languages like Java and Python, and I'm excited to apply my skills to real-world projects. I'm looking forward to contributing to a dynamic team and learning from experienced professionals at XYZ Company. \", \"My passion for technology and problem-solving led me to pursue a career in Software Engineering. During my studies, I focused on mastering key programming languages and understanding software development principles. I'm enthusiastic about applying my knowledge to practical projects and gaining hands-on experience in the industry. I'm eager to grow and learn in a supportive environment like XYZ Company.\", \"As a recent graduate in Software Engineering, I bring a fresh perspective and a strong foundation in programming concepts. I have practical experience in coding projects and collaborating with peers on software development tasks. I'm eager to leverage my skills in Java, Python, and problem-solving to contribute effectively to a dynamic team at XYZ Company.\"],\n     \"context\": [\"\"]\n    },\n   {\"tag\": \"attire\",\n     \"patterns\": [\"What should I wear to the interview?\", \"How formal or casual should I dress for the interview?\", \"Is it okay to wear jeans and a t-shirt to the interview?\", \"Is it okay to wear a cultural outfit like a saree or kurta to the interview?\"],\n     \"responses\": [\"For a job interview, it's best to dress in business professional attire. This typically means wearing a suit and tie for men, or a suit, dress, or pantsuit for women.\", \"For an interview, you'll want to dress a step above how you'd dress for the actual job. If the company has a casual dress code, you can wear nice slacks or khakis with a collared shirt for men, or a blouse and skirt/pants for women.\", \"The appropriate interview attire can vary depending on the company culture and the role you're interviewing for. In general, it's better to err on the side of being too dressed up rather than too casual.\"],\n     \"context\": [\"\"]\n    }, \n     {\"tag\": \"company\",\n     \"patterns\": [\"Why are you interested in working for our company?\", \"What do you find appealing about our company as a potential employer?\", \"How do you think our company aligns with your career goals and aspirations?\"],\n     \"responses\": [\"I am drawn to your company because of its strong reputation for innovation, commitment to employee development, and positive impact in the industry. Your focus on fostering a collaborative work environment and dedication to excellence resonates with my values and career objectives.\", \"I'm really interested in working here because of your company's great reputation. You focus on helping employees grow, and that's important to me and my career goals. I think I'd be a great fit for your collaborative work environment.\"],\n     \"context\": [\"\"]\n    },\n     {\"tag\": \"salary\",\n     \"patterns\": [\"What are your salary expectations for this position?\", \"Can you share your expected salary range for this role?\", \"How do you determine your value and set your salary expectations?\", \"Have you researched industry standards to inform your salary expectations?\"],\n     \"responses\": [\"As a fresher, I am seeking a competitive salary that reflects the industry standards and the value I can bring to the role. I have researched typical salary ranges for similar positions to inform my expectations and ensure they are reasonable and in line with market trends\", \"I'm looking for a fair salary that matches the job requirements and my skills as a recent graduate, based on my research of typical pay for similar entry-level positions in this field.\"],\n     \"context\": [\"\"]\n    },\n    {\"tag\": \"resume\",\n     \"patterns\": [\"Can you walk me through your educational background as mentioned in your resume?\", \"What projects or internships are you most proud of from your resume?\", \"How do the skills and experiences highlighted in your resume make you a strong candidate for this role?\"],\n     \"responses\": [\"My resume shows I recently graduated with a Computer Science degree and completed projects in Java and Python. I'm proud of my web development internships, which demonstrate my skills and passion for this field. I believe my education, problem-solving, communication, and eagerness to learn make me a strong candidate\", \"After earning my Computer Science degree, I undertook Java and Python projects, notably excelling in web development during internships. These experiences reflect my passion for the field and demonstrate my problem-solving, communication, and tech-learning enthusiasm, making me a fitting candidate for this role.\"],\n     \"context\": [\"\"]\n    },\n     {\"tag\": \"goals\",\n     \"patterns\": [\"What are your long-term career aspirations?\", \"Where do you see yourself in the next 5-10 years?\", \"How do you plan to achieve your professional goals?\"],\n     \"responses\": [\"My long-term goals are to become an expert in my field, take on leadership roles to drive innovation, and keep learning to make a big impact. In the next 5-10 years, I want to take on more responsibilities, help the team succeed, and potentially become a manager. To get there, I'll actively look for learning opportunities, take on challenging projects, and build relationships with mentors who can guide my career growth.\", \"My career aspirations involve continuously expanding my expertise, taking on greater responsibilities, and eventually transitioning into a leadership role where I can drive strategic initiatives and mentor others. To achieve these goals, I plan to proactively seek out learning opportunities, take on stretch assignments, and build strong relationships with experienced professionals who can provide guidance and support along the way\"],\n     \"context\": [\"\"]\n    },\n    {\"tag\": \"work style\",\n     \"patterns\": [\"How would you describe your work style and approach to tasks?\", \"What is your ideal working environment and how do you thrive in it?\", \"Do you prefer working independently or as part of a team, and why?\"],\n     \"responses\": [\"I thrive in collaborative environments that encourage teamwork, open communication, and continuous learning. While I enjoy working independently, I value the synergy of teamwork and maintain a positive, detail-oriented approach to deliver quality work on time, using a mix of digital tools and handwritten notes to stay organized and productive.\", \"I prefer a work style that combines independent focus with team collaboration, as I find that diverse perspectives often lead to the best solutions. My ideal working environment is fast-paced yet supportive, where I can take on challenging projects, learn continuously, and contribute my skills to achieve shared goals.\"],\n     \"context\": [\"\"]\n    }\n]}": null}